import datetime as dt
import math

def calculate_values_count():
    time_value_H = int(dt.datetime.now().strftime('%H'))
    time_value_M = int(dt.datetime.now().strftime('%M'))
    return math.floor(time_value_H*6 + time_value_M*0.1)

def calculate_page_count():
    time_value_H = int(dt.datetime.now().strftime('%H'))
    return math.ceil(time_value_H * 0.6)

def get_area_name(area_code):
    area_mapping = {
        "0011": "홍릉_도심", "0012": "홍릉_숲내부5m", "0013": "홍릉_숲내부20m",
        "0021": "고매_도로", "0022": "고매_50m", "0023": "고매_150m",
        "0031": "시화_산단", "0032": "시화_차단숲", "0033": "시화_주거",
        "0041": "양재_도로", "0042": "양재_200m", "0043": "양재_300m",
        "0051": "관악_도심", "0052": "관악_캠퍼스", "0053": "관악_숲",
        "0061": "제주_5m", "0062": "제주_10m", "0063": "제주_20m",
        "0071": "고양_산단", "0072": "고양_주거", "0073": "고양_숲",
        "0081": "기장_산단", "0082": "기장_숲", "0083": "기장_주거",
        "0091": "평창_5m", "0092": "평창_20m", "0093": "평창_30m",
        "0101": "횡성_5m", "0102": "횡성_20m", "0103": "횡성_30m",
        "0111": "남산_5m", "0112": "남산_13.5m", "0113": "남산_25.5m",
        "0121": "남산_숲", "0122": "남산_고개", "0123": "남산_자락",
        "0131": "전주_산단", "0132": "전주_주거1", "0133": "전주_주거2",
        "0141": "인천_해안", "0142": "인천_주거1", "0143": "인천_주거2",
        "0151": "인천_산단", "0152": "인천_완충", "0153": "인천_주거",
        "0161": "울산_산단", "0162": "울산_숲", "0163": "울산_주거",
        "0171": "태안_산단", "0172": "태안_숲", "0173": "태안_주거",
        "0181": "광주_산단", "0182": "광주_숲", "0183": "광주_주거",
        "0191": "대구_산단", "0192": "대구_주거", "0193": "대구_강가",
        "0201": "대전_산단", "0202": "대전_주거1", "0203": "대전_주거2",
        "0211": "나주_오염", "0212": "나주_주거", "0213": "나주_산림",
        "0221": "세종_도시", "0222": "세종_주거", "0223": "세종_숲",
        "0231": "강릉_산림", "0232": "강릉_주거", "0233": "강릉_해안",
        "0241": "양구_국외(산림)", "0242": "양구_주거", "0243": "양구_산림",
        "0251": "연천_국외(산림)", "0252": "연천_주거", "0253": "연천_파주(산림)",
        "0261": "순천_여수(공단)", "0262": "순천_차단숲", "0263": "순천_주거",
        "0271": "칠곡_도심(산단)", "0272": "칠곡_주거", "0273": "칠곡_산림",
        "0281": "예산_산단", "0282": "예산_주거", "0283": "예산_산림",
        "0291": "완도_지상", "0292": "완도_15M", "0293": "완도_30m",
        "0301": "충주_산단", "0302": "충주_주거", "0303": "충주_산림",
        "0311": "춘천_주거1", "0312": "춘천_주거2", "0313": "춘천_산림",
        "0321": "종로_도심", "0322": "종로_주거", "0323": "종로_숲",
        "0331": "구미_산단", "0332": "구미_주거2", "0333": "구미_산림",
        "0341": "삼척_동해_주거1", "0342": "삼척_동해_주거2", "0343": "삼척_동해_산림",
        "0351": "양간지대_주거1", "0352": "양간지대_주거2", "0353": "양간지대_숲",
        "0361": "청주_산단", "0362": "청주_주거2", "0363": "청주_숲",
        "0371": "선릉_5m", "0372": "선릉_12m", "0373": "선릉_19m",
        "0381": "강화_월곶", "0382": "강화_평화", "0383": "강화_석모도",
        "0391": "철원_고석정", "0392": "철원_평화", "0393": "철원_고대산",
        "0401": "파주_쇠재", "0402": "파주_월롱", "0403": "파주_체육",
        "0411": "괴산_차단숲", "0412": "증평_저감숲", "0413": "괴산_국유림",
        "0421": "포항_저감숲", "0422": "포항_차단숲", "0423": "포항_농경지",
        "0431": "영주_저감숲", "0432": "영주_농경지", "0433": "영주_치유원",
        "0441": "미시령_고개", "0442": "미시령_활엽", "0443": "미시령_침엽",
        "0451": "창경궁_지상", "0452": "창경궁_10m", "0453": "창경궁_19m"
    }
    return area_mapping.get(area_code, "Unknown Area")
